In [2]:
import pandas as pd
import seaborn as sns
df = sns.load_dataset("titanic")

In [4]:
df[df["age"] > 50].head() # Yaşı 50 den büyük ilk beş değer

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
33,0,2,male,66.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
54,0,1,male,65.0,0,1,61.9792,C,First,man,True,B,Cherbourg,no,False

In [7]:
df[df["age"] > 50]["age"].count() # 50 den büyük kaç kişi var

64

In [8]:
df.loc[df["age"] > 50, "class"].head() # 50 den büyük olanların sınıf bilgisi

6      First
11     First
15    Second
33    Second
54     First
Name: class, dtype: category
Categories (3, object): ['First', 'Second', 'Third']

In [9]:
df.loc[df["age"] > 50, ["age","class"]].head() # 50 den büyük olanların yaş ve sınıf bilgisi

     age   class
6   54.0   First
11  58.0   First
15  55.0  Second
33  66.0  Second
54  65.0   First

In [11]:
df.loc[(df["age"] > 50) & (df["sex"] == "male"), ["age","class"]].head() # Erkek ve yaşı 50 den büyük -> Yaş ve sınıflarını sorduk

     age   class
6   54.0   First
33  66.0  Second
54  65.0   First
94  59.0   Third
96  71.0   First

In [18]:
df.loc[(df["age"] > 50) & (df["sex"] == "male") & (df["embark_town"] == "Cherbourg"), ["age","class","embark_town"]].head() # 3 değişkenli bir sorgu

      age  class embark_town
54   65.0  First   Cherbourg
96   71.0  First   Cherbourg
155  51.0  First   Cherbourg
174  56.0  First   Cherbourg
487  58.0  First   Cherbourg

In [17]:
df_new = df.loc[(df["age"] > 50) & (df["sex"] == "male") & ((df["embark_town"] == "Cherbourg") | (df["embark_town"] == "Southampton")), ["age","class","embark_town"]]
df_new["embark_town"].value_counts()
# Yaş,cinsiyet,bindiği liman olmak üzere sorgu yaparak bu sorguları yeni bir değişkene atayıp liman değerlerini yazdırdık.

Southampton    35
Cherbourg       9
Name: embark_town, dtype: int64